generator/tsung/conf.xml
<!--
Copyright 2021 Ericsson AB

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
-->

<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
	  <server host="172.17.254.3" port="5000" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="15" unit="minute">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <request>
	      <http url='http://172.18.255.2:80/' version='1.1' method='POST'  content_type='application/json' contents_from_file="/home/gts/go_projects/src/application-generator/tsung/chain1_gaming.json">
                <http_header name="Host" value="frontend.com"/>
	      </http>
      </request>
      <request>
	      <http url='http://172.18.255.2:80/' version='1.1' method='POST'  content_type='application/json' contents_from_file="/home/gts/go_projects/src/application-generator/tsung/chain2_gaming.json">
                <http_header name="Host" value="frontend.com"/>
              </http>
      </request>
      <thinktime value="2" random="true"></thinktime>
    </session>
  </sessions>
</tsung>